---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryConnectedCurrentParam
source: html/766598c1-32a0-b951-a75a-c02cd2da95f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryConnectedCurrentParam Property

"Connected Current"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecLoadsummaryConnectedCurrentParam { get; }
```